       IDENTIFICATION DIVISION.
       PROGRAM-ID. MR-TEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-FLAG PIC X.
       PROCEDURE DIVISION.
       0000-MAIN.
           ALTER 0100-PROCESS TO PROCEED TO 0200-EXIT.
           PERFORM 0100-PROCESS.
           STOP RUN.
       0100-PROCESS.
           MOVE 'Y' TO WS-FLAG.
       0200-EXIT.
           EXIT.
