       IDENTIFICATION DIVISION.
       PROGRAM-ID. COPYTEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY CUSTBOOK.
       01 WS-TOTAL PIC S9(9)V99.
       PROCEDURE DIVISION.
       0000-MAIN.
           MOVE 123456 TO CUST-ID.
           MOVE 'JOHN SMITH' TO CUST-NAME.
           MOVE 5000.00 TO CUST-BAL.
           ADD CUST-BAL TO WS-TOTAL.
           DISPLAY WS-TOTAL.
           STOP RUN.
