       IDENTIFICATION DIVISION.
       PROGRAM-ID. PORT1.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-X PIC 9(3) VALUE 100.
       PROCEDURE DIVISION.
       0000-MAIN.
           ADD 50 TO WS-X.
           STOP RUN.
