       IDENTIFICATION DIVISION.
       PROGRAM-ID. PORT2.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NAME PIC X(20) VALUE 'HELLO WORLD'.
       PROCEDURE DIVISION.
       0000-MAIN.
           DISPLAY WS-NAME.
           STOP RUN.
