//TESTJOB  JOB (ACCT),'QA TEST',CLASS=A
//STEP01   EXEC PGM=SORT
//SORTIN   DD DSN=INPUT.FILE,DISP=SHR
//SORTOUT  DD DSN=OUTPUT.FILE,
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(CYL,(10,5),RLSE)
//SYSIN    DD *
  SORT FIELDS=(1,10,CH,A)
/*
//STEP02   EXEC PGM=IEFBR14
//DELFILE  DD DSN=TEMP.FILE,DISP=(OLD,DELETE)
