       IDENTIFICATION DIVISION.
       PROGRAM-ID. VERIFY-TEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NAME   PIC X(10).
       01 WS-AMOUNT PIC 9(5)V99.
       PROCEDURE DIVISION.
       0000-MAIN.
           ACCEPT WS-NAME.
           ACCEPT WS-AMOUNT.
           DISPLAY WS-NAME.
           DISPLAY WS-AMOUNT.
           STOP RUN.
