       IDENTIFICATION DIVISION.
       PROGRAM-ID. NEGATIVE-TO-UNSIGNED.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-SIGNED     PIC S9(5)V99.
       01  WS-UNSIGNED   PIC 9(5)V99.
       PROCEDURE DIVISION.
       0000-MAIN.
           MOVE WS-SIGNED TO WS-UNSIGNED.
           STOP RUN.
