       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBTRACT-TO-NEGATIVE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-BALANCE    PIC S9(5)V99.
       01  WS-DEBIT      PIC S9(5)V99.
       PROCEDURE DIVISION.
       0000-MAIN.
           SUBTRACT WS-DEBIT FROM WS-BALANCE.
           STOP RUN.
