      CBL TRUNC(BIN)
       IDENTIFICATION DIVISION.
       PROGRAM-ID. CBL-TRUNC-BIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-BIN-VAL     PIC S9(4) COMP.
       01  WS-RESULT      PIC S9(5).
       PROCEDURE DIVISION.
       0000-MAIN.
           MOVE 9999 TO WS-BIN-VAL.
           COMPUTE WS-RESULT = WS-BIN-VAL + 1.
           STOP RUN.
