       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRECISION-31-DIGIT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-LARGE       PIC S9(9)V9(8).
       01  WS-FACTOR      PIC S9(1)V9(8).
       01  WS-RESULT      PIC S9(9)V9(8).
       PROCEDURE DIVISION.
       0000-MAIN.
           COMPUTE WS-RESULT = WS-LARGE * WS-FACTOR.
           STOP RUN.
