       IDENTIFICATION DIVISION.
       PROGRAM-ID. ACCEPT-DATE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-DATE         PIC X(6).
       PROCEDURE DIVISION.
       0000-MAIN.
           ACCEPT WS-DATE FROM DATE.
           STOP RUN.
