       IDENTIFICATION DIVISION.
       PROGRAM-ID. COMPUTE-FUNCTION-LENGTH.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-STR           PIC X(10) VALUE "HELLO".
       01  WS-RESULT        PIC 9(4) VALUE 0.
       PROCEDURE DIVISION.
       0000-MAIN.
           COMPUTE WS-RESULT = FUNCTION LENGTH(WS-STR).
           DISPLAY WS-RESULT.
           STOP RUN.
