       IDENTIFICATION DIVISION.
       PROGRAM-ID. COMPUTE-FUNCTION-INTEGER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-A             PIC 9(4)V9 VALUE 3.7.
       01  WS-RESULT        PIC 9(4) VALUE 0.
       PROCEDURE DIVISION.
       0000-MAIN.
           COMPUTE WS-RESULT = FUNCTION INTEGER(WS-A).
           DISPLAY WS-RESULT.
           STOP RUN.
