       IDENTIFICATION DIVISION.
       PROGRAM-ID. COMP5-NATIVE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-NATIVE       PIC 9(4) COMP-5.
       01  WS-RESULT       PIC 9(5).
       PROCEDURE DIVISION.
       0000-MAIN.
           MOVE 50000 TO WS-NATIVE.
           MOVE WS-NATIVE TO WS-RESULT.
           STOP RUN.
