       IDENTIFICATION DIVISION.
       PROGRAM-ID. COMP-VALUE-INIT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-A           PIC 9(4) COMP VALUE 9999.
       01  WS-B           PIC 9(5).
       PROCEDURE DIVISION.
       0000-MAIN.
           MOVE WS-A TO WS-B.
           STOP RUN.
