       IDENTIFICATION DIVISION.
       PROGRAM-ID. COMP3-MAX.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-PACKED       PIC S9(18) COMP-3.
       01  WS-RESULT       PIC 9(18).
       PROCEDURE DIVISION.
       0000-MAIN.
           MOVE 999999999999999999 TO WS-PACKED.
           MOVE WS-PACKED TO WS-RESULT.
           STOP RUN.
