       IDENTIFICATION DIVISION.
       PROGRAM-ID. COMP3-SIGN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-PACKED       PIC S9(5) COMP-3.
       01  WS-RESULT       PIC S9(5).
       PROCEDURE DIVISION.
       0000-MAIN.
           MOVE -12345 TO WS-PACKED.
           MOVE WS-PACKED TO WS-RESULT.
           STOP RUN.
