       IDENTIFICATION DIVISION.
       PROGRAM-ID. COMPUTE-FUNCTION-ABS.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-A             PIC S9(4) VALUE -42.
       01  WS-RESULT        PIC 9(4) VALUE 0.
       PROCEDURE DIVISION.
       0000-MAIN.
           COMPUTE WS-RESULT = FUNCTION ABS(WS-A).
           DISPLAY WS-RESULT.
           STOP RUN.
