       IDENTIFICATION DIVISION.
       PROGRAM-ID. COMMA-DISPLAY.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-AMT         PIC 9(3)V99.
       PROCEDURE DIVISION.
       0000-MAIN.
           COMPUTE WS-AMT = 123,45.
           STOP RUN.
