       IDENTIFICATION DIVISION.
       PROGRAM-ID. COMMA-STRING.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-A           PIC X(5) VALUE 'HELLO'.
       01  WS-B           PIC X(10).
       PROCEDURE DIVISION.
       0000-MAIN.
           STRING WS-A DELIMITED BY SIZE
               INTO WS-B.
           STOP RUN.
