       IDENTIFICATION DIVISION.
       PROGRAM-ID. DISPLAY-EXPLICIT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-A           PIC 9(5) DISPLAY VALUE 54321.
       01  WS-B           PIC 9(5).
       PROCEDURE DIVISION.
       0000-MAIN.
           MOVE WS-A TO WS-B.
           STOP RUN.
