       IDENTIFICATION DIVISION.
       PROGRAM-ID. DIV-BY-ZERO.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-TARGET     PIC 9(5) VALUE 100.
       01  WS-DIVISOR    PIC 9(5) VALUE 0.
       01  WS-RESULT     PIC 9(5) VALUE 100.
       PROCEDURE DIVISION.
       0000-MAIN.
           DIVIDE WS-DIVISOR INTO WS-RESULT
               ON SIZE ERROR
                   MOVE 99999 TO WS-TARGET.
           STOP RUN.
