       IDENTIFICATION DIVISION.
       PROGRAM-ID. DIVIDE-INTO-VS-BY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-A             PIC 9(4) VALUE 500.
       01  WS-RESULT        PIC 9(4) VALUE 0.
       PROCEDURE DIVISION.
       0000-MAIN.
           DIVIDE 100 INTO WS-A GIVING WS-RESULT.
           DISPLAY WS-RESULT.
           STOP RUN.
