       IDENTIFICATION DIVISION.
       PROGRAM-ID. DIV-REMAIN-NEG.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-DIVIDEND      PIC S9(3) VALUE -17.
       01  WS-DIVISOR       PIC S9(3) VALUE 5.
       01  WS-QUOTIENT      PIC S9(3).
       01  WS-REMAINDER     PIC S9(3).
       PROCEDURE DIVISION.
       0000-MAIN.
           DIVIDE WS-DIVIDEND BY WS-DIVISOR
               GIVING WS-QUOTIENT
               REMAINDER WS-REMAINDER.
           DISPLAY WS-QUOTIENT.
           DISPLAY WS-REMAINDER.
           STOP RUN.
