       IDENTIFICATION DIVISION.
       PROGRAM-ID. NATIONAL-MR.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-NATIONAL   PIC N(10).
       01  WS-RESULT     PIC X(5).
       PROCEDURE DIVISION.
       0000-MAIN.
           MOVE 'DONE' TO WS-RESULT.
           STOP RUN.
