       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXT-TEST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-EXTERNAL        PIC X(10) EXTERNAL.
       01  WS-OUT             PIC X(10).
       PROCEDURE DIVISION.
       0000-MAIN.
           MOVE 'TESTING' TO WS-EXTERNAL.
           MOVE WS-EXTERNAL TO WS-OUT.
           STOP RUN.
