       IDENTIFICATION DIVISION.
       PROGRAM-ID. INSP-REPL-FIRST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-STR          PIC X(6).
       PROCEDURE DIVISION.
       0000-MAIN.
           INSPECT WS-STR REPLACING FIRST 'A' BY 'X'.
           STOP RUN.
