       IDENTIFICATION DIVISION.
       PROGRAM-ID. INSP-TALLY-LEAD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-STR          PIC X(5).
       01  WS-CNT          PIC 9(3) VALUE 0.
       PROCEDURE DIVISION.
       0000-MAIN.
           INSPECT WS-STR TALLYING WS-CNT
               FOR LEADING '0'.
           STOP RUN.
