       IDENTIFICATION DIVISION.
       PROGRAM-ID. MULTIPLY-BY-ZERO.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-A             PIC 9(4) VALUE 999.
       01  WS-RESULT        PIC 9(4) VALUE 0.
       PROCEDURE DIVISION.
       0000-MAIN.
           MULTIPLY 0 BY WS-A GIVING WS-RESULT.
           DISPLAY WS-RESULT.
           STOP RUN.
