       IDENTIFICATION DIVISION.
       PROGRAM-ID. PIC-V99-DECIMAL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-RATE          PIC V99 VALUE .75.
       01  WS-AMOUNT        PIC 9(5) VALUE 10000.
       01  WS-RESULT        PIC 9(5)V99.
       PROCEDURE DIVISION.
       0000-MAIN.
           MULTIPLY WS-AMOUNT BY WS-RATE
               GIVING WS-RESULT.
           DISPLAY WS-RESULT.
           STOP RUN.
