       IDENTIFICATION DIVISION.
       PROGRAM-ID. PIC-P-SCALING.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-SCALED        PIC PP999.
       01  WS-RESULT        PIC 9(5)V99.
       01  WS-FACTOR        PIC 9(3) VALUE 100.
       PROCEDURE DIVISION.
       0000-MAIN.
           MOVE 123 TO WS-SCALED.
           MULTIPLY WS-SCALED BY WS-FACTOR
               GIVING WS-RESULT.
           DISPLAY WS-RESULT.
           STOP RUN.
