       IDENTIFICATION DIVISION.
       PROGRAM-ID. PIC-9V9-TO-9V99.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-SOURCE     PIC 9V9       VALUE 1.5.
       01  WS-TARGET     PIC 9V99.
       01  WS-DISPLAY    PIC 9.99.
       PROCEDURE DIVISION.
       0000-MAIN.
           MOVE WS-SOURCE TO WS-TARGET.
           MOVE WS-TARGET TO WS-DISPLAY.
           STOP RUN.
