       IDENTIFICATION DIVISION.
       PROGRAM-ID. TRUNC-BIN-COMP.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-COMP-VAR   PIC 9(4) COMP.
       01  WS-RESULT     PIC 9(5).
       PROCEDURE DIVISION.
       0000-MAIN.
           MOVE 65535 TO WS-COMP-VAR.
           MOVE WS-COMP-VAR TO WS-RESULT.
           STOP RUN.
