       IDENTIFICATION DIVISION.
       PROGRAM-ID. MULTIPLY-TRUNCATE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-A          PIC S9(3)V99.
       01  WS-B          PIC S9(3)V99.
       01  WS-RESULT     PIC S9(3)V99.
       PROCEDURE DIVISION.
       0000-MAIN.
           MULTIPLY WS-A BY WS-B GIVING WS-RESULT.
           STOP RUN.
