       IDENTIFICATION DIVISION.
       PROGRAM-ID. NEGATIVE-DIVIDE-TRUNCATE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-A          PIC S9(5)V99.
       01  WS-B          PIC S9(5)V99.
       01  WS-RESULT     PIC S9(5)V99.
       PROCEDURE DIVISION.
       0000-MAIN.
           DIVIDE WS-A BY WS-B GIVING WS-RESULT.
           STOP RUN.
