       IDENTIFICATION DIVISION.
       PROGRAM-ID. PERFORM-THRU-RANGE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-COUNTER    PIC 9(3).
       PROCEDURE DIVISION.
       0000-MAIN.
           MOVE 0 TO WS-COUNTER.
           PERFORM 1000-STEP-A THRU 3000-STEP-C.
           STOP RUN.
       1000-STEP-A.
           ADD 1 TO WS-COUNTER.
       2000-STEP-B.
           ADD 10 TO WS-COUNTER.
       3000-STEP-C.
           ADD 100 TO WS-COUNTER.
