       IDENTIFICATION DIVISION.
       PROGRAM-ID. PERFORM-PARA-TIMES.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-COUNTER    PIC 9(3).
       PROCEDURE DIVISION.
       0000-MAIN.
           MOVE 0 TO WS-COUNTER.
           PERFORM 1000-ADD-ONE 5 TIMES.
           STOP RUN.
       1000-ADD-ONE.
           ADD 1 TO WS-COUNTER.
