       IDENTIFICATION DIVISION.
       PROGRAM-ID. PERFORM-TIMES.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-COUNTER    PIC 9(3).
       01  WS-LIMIT      PIC 9(3).
       PROCEDURE DIVISION.
       0000-MAIN.
           MOVE 0 TO WS-COUNTER.
           MOVE 5 TO WS-LIMIT.
           PERFORM 1000-INCREMENT UNTIL WS-COUNTER = 5.
           STOP RUN.
       1000-INCREMENT.
           ADD 1 TO WS-COUNTER.
