       IDENTIFICATION DIVISION.
       PROGRAM-ID. COMMA-MOVE-MUL.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-RATE       PIC S9(1)V9(4).
       01 WS-PRINCIPAL  PIC S9(7)V99.
       01 WS-INTEREST   PIC S9(7)V99.
       PROCEDURE DIVISION.
       0000-MAIN.
           MOVE 0,0350 TO WS-RATE.
           COMPUTE WS-INTEREST = WS-PRINCIPAL * WS-RATE.
           STOP RUN.
