       IDENTIFICATION DIVISION.
       PROGRAM-ID. COMMA-COMPUTE.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-A          PIC S9(5)V99.
       01 WS-B          PIC S9(5)V99.
       01 WS-RESULT     PIC S9(7)V99.
       PROCEDURE DIVISION.
       0000-MAIN.
           COMPUTE WS-RESULT = WS-A + WS-B.
           STOP RUN.
